app/Controllers/AdminController.php

    public function dashboard()
    {
        if ($redirect = $this->requireAdminLogin()) {
            return $redirect;
        }

        $participantModel = new ParticipantModel();
        $attendanceModel  = new AttendanceLogModel();

        $totalParticipants = $participantModel->countAllResults();
        $hadir = $attendanceModel->where('first_scanned_at IS NOT NULL')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `participants`
SELECT COUNT(*) AS `numrows`
FROM `attendance_logs`
WHERE `first_scanned_at` IS NOT NULL

                $participantModel->update($existing['id'], $data);
                $updated++;
            } else {
                $participantModel->insert($data);
---
INSERT INTO `participants` (`participant_number`, `full_name`, `position`, `birth_date`, `work_unit`, `raw_data`, `imported_at`, `created_at`, `updated_at`) VALUES ('24302330110002322', 'RIYAN BAYU ALDI SAPUTRA', 'ANALIS SUMBER DAYA MANUSIA APARATUR AHLI PERTAMA', '2000-02-08', 'Kementerian HAM Kantor Pusat', '{\"Jabatan\":\"ANALIS SUMBER DAYA MANUSIA APARATUR AHLI PERTAMA\",\"Formasi\":\"KEMENTERIAN HAK ASASI MANUSIA | KANTOR PUSAT\",\"No Peserta\":\"24302330110002322\",\"Nama\":\"RIYAN BAYU ALDI SAPUTRA\",\"Pendidikan\":\"S-1 ADMINISTRASI PUBLIK\",\"Tanggal Lahir\":\"2000-02-08\",\"Unit Kerja Penyelenggara\":\"Kementerian HAM Kantor Pusat\",\"Lokasi Ujian\":\"Royal Kuningan Hotel\",\"Alamat\":\"Jl. Kuningan Persada No.2, Guntur, Kecamatan Setiabudi, Kota Jakarta Selatan, Daerah Khusus Jakarta\",\"Hari\":\"Senin\",\"Tanggal\":\"30 Maret 2026\",\"Sesi\":\"1\",\"Jam\":\"08.00\",\"Zona Waktu\":\"WIB\"}', '2026-03-15 13:27:06', '2026-03-15 13:27:06', '2026-03-15 13:27:06')