app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `participants`
SELECT COUNT(*) AS `numrows`
FROM `participants` `p`
INNER JOIN `attendance_logs` `a` ON `a`.`participant_id` = `p`.`id`
WHERE `a`.`first_scanned_at` IS NOT NULL
---
    public function dashboard()
    {
        if ($redirect = $this->requireAdminLogin()) {
            return $redirect;
        }

        $participantModel = new ParticipantModel();
        $scopedWorkUnit = $this->getScopedWorkUnit();

        $participantBuilder = $participantModel->builder();
        if ($scopedWorkUnit !== null) {
            $participantBuilder->where('work_unit', $scopedWorkUnit);
        }
        $totalParticipants = $participantBuilder->countAllResults();

        $attendanceBuilder = db_connect()->table('participants p')
            ->join('attendance_logs a', 'a.participant_id = p.id', 'inner')
            ->where('a.first_scanned_at IS NOT NULL');
        if ($scopedWorkUnit !== null) {
            $attendanceBuilder->where('p.work_unit', $scopedWorkUnit);
        }
        $hadir = $attendanceBuilder->countAllResults();

SELECT `l`.*, `a`.`username`, `a`.`work_unit`
FROM `admin_login_logs` `l`
LEFT JOIN `admins` `a` ON `a`.`id` = `l`.`admin_id`
WHERE `l`.`admin_role` = 'admin_unit'
ORDER BY `l`.`login_at` DESC
 LIMIT 500
---
    public function loginLogs()
    {
        if ($redirect = $this->requireAdminLogin()) {
            return $redirect;
        }
        if ($redirect = $this->requireSuperAdmin()) {
            return $redirect;
        }

        $rows = db_connect()->table('admin_login_logs l')
            ->select('l.*, a.username, a.work_unit')
            ->join('admins a', 'a.id = l.admin_id', 'left')
            ->where('l.admin_role', 'admin_unit')
            ->orderBy('l.login_at', 'DESC')
            ->limit(500)
            ->get()
            ->getResultArray();

SELECT `s`.*, `a`.`username`, `a`.`work_unit`, `p`.`participant_number`, `p`.`full_name`
FROM `attendance_scan_events` `s`
LEFT JOIN `admins` `a` ON `a`.`id` = `s`.`admin_id`
LEFT JOIN `participants` `p` ON `p`.`id` = `s`.`participant_id`
WHERE `a`.`role` = 'admin_unit'
ORDER BY `s`.`scanned_at` DESC
 LIMIT 1000
---
    public function scanLogs()
    {
        if ($redirect = $this->requireAdminLogin()) {
            return $redirect;
        }
        if ($redirect = $this->requireSuperAdmin()) {
            return $redirect;
        }

        $rows = db_connect()->table('attendance_scan_events s')
            ->select('s.*, a.username, a.work_unit, p.participant_number, p.full_name')
            ->join('admins a', 'a.id = s.admin_id', 'left')
            ->join('participants p', 'p.id = s.participant_id', 'left')
            ->where('a.role', 'admin_unit')
            ->orderBy('s.scanned_at', 'DESC')
            ->limit(1000)
            ->get()
            ->getResultArray();