app/Models/AdminModel.php

SELECT *
FROM `admins`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function verifyLogin(string $username, string $password): ?array
    {
        $admin = $this->where('username', $username)->first();