app/Models/ParticipantModel.php

    public function getDistinctPositions(): array
    {
        return $this->distinct()->select('position')->orderBy('position', 'ASC')->findAll();
---
SELECT DISTINCT `position`
FROM `participants`
ORDER BY `position` ASC

    public function findVerified(string $participantNumber, string $position, string $birthDate): ?array
    {
        return $this->where('participant_number', trim($participantNumber))
            ->where('position', trim($position))
            ->where('birth_date', $birthDate)
            ->first();
---
SELECT *
FROM `participants`
WHERE `participant_number` = '24302330110008096'
AND `position` = 'ANALIS SUMBER DAYA MANUSIA APARATUR AHLI PERTAMA'
AND `birth_date` = '1995-05-05'
 LIMIT 1

    public function findByParticipantNumber(string $participantNumber): ?array
    {
        return $this->where('participant_number', trim($participantNumber))->first();
---
SELECT *
FROM `participants`
WHERE `participant_number` = '24302330110002322'
 LIMIT 1

    public function getReportRows(?string $workUnit = null, ?string $position = null, string $status = 'all'): array
    {
        $builder = $this->db->table($this->table . ' p')
            ->select('p.*, a.first_scanned_at, a.scan_count')
            ->join('attendance_logs a', 'a.participant_id = p.id', 'left')
            ->orderBy('p.participant_number', 'ASC');

        if ($workUnit !== null && $workUnit !== '') {
            $builder->where('p.work_unit', $workUnit);
        }

        if ($position !== null && $position !== '') {
            $builder->where('p.position', $position);
        }

        if ($status === 'hadir') {
            $builder->where('a.first_scanned_at IS NOT NULL');
        } elseif ($status === 'tidak_hadir') {
            $builder->where('a.first_scanned_at IS NULL');
        }

        return $builder->get()->getResultArray();
---
SELECT `p`.*, `a`.`first_scanned_at`, `a`.`scan_count`
FROM `participants` `p`
LEFT JOIN `attendance_logs` `a` ON `a`.`participant_id` = `p`.`id`
WHERE `p`.`work_unit` = 'Kementerian HAM Kanwil Sulawesi Selatan'
ORDER BY `p`.`participant_number` ASC

    public function getDistinctWorkUnits(): array
    {
        return $this->distinct()->select('work_unit')->where('work_unit IS NOT NULL')->orderBy('work_unit', 'ASC')->findAll();
---
SELECT DISTINCT `work_unit`
FROM `participants`
WHERE `work_unit` IS NOT NULL
ORDER BY `work_unit` ASC