app/Models/Peserta.php

    public function getDistinctJabatan()
    {
        $builder = $this->db->table($this->table);
        return $builder->distinct()->select('jabatan')->where('jabatan IS NOT NULL')->get();
---
SELECT DISTINCT `jabatan`
FROM `peserta`
WHERE `jabatan` IS NOT NULL

    public function updateDtRegist($no_peserta, $dt_regist)
    {
        return $this->where('no_peserta', $no_peserta)->set('dt_regist', $dt_regist)->update();
---
UPDATE `peserta` SET `dt_regist` = '2026-03-06 21:43:59'
WHERE `no_peserta` = '24302330110000004'

    public function getByTilokSktt($tilok_sktt)
    {
        return $this->where('tilok_sktt', $tilok_sktt)->findAll();
---
SELECT *
FROM `peserta`
WHERE `tilok_sktt` = 'KANWIL KALTIM'